app/Http/Controllers/AdherantController.php

    public function index()
    {
        $userId = auth()->id();
        return Inertia::render('Adherants/Index', [
            'adherants' => Adherant::query()
                ->where('user_id', $userId)
                ->when(Request::input('search'), function ($query, $search) {
                    $query->where('first_name', 'like', '%' . $search . '%')
                        ->OrWhere('last_name', 'like', '%' . $search . '%')
                        ->OrWhere('cin', 'like', '%' . $search . '%')
                        ->OrWhere('tel', 'like', '%' . $search . '%')
                        ->OrWhere('email', 'like', '%' . $search . '%');
                })->paginate(5)
                ->appends(Request::all()),
        ]);
---
select * from `adherants` where `user_id` = 1 limit 5 offset 0
select count(*) as aggregate from `adherants` where `user_id` = 1