app/Http/Controllers/DashboardController.php

select `created_at` from `groupes` where `user_id` = 1
---
    public function getGroupesData()
    {
        $userId = auth()->id();
        $groupes = Groupe::select('created_at')
            ->where('user_id', $userId)
            ->get()
            ->groupBy(function ($date) {
                return Carbon::parse($date->created_at)->format('Y-m-d');
            });

select count(*) as aggregate from `groupes` where `user_id` = 1
select count(*) as aggregate from `adherants` where `user_id` = 1
select count(*) as aggregate from `stocks` where `user_id` = 1
select * from `cotisations`
select sum(`montant`) as aggregate from `cotisations`
---
    public function index()
    {
        $userId = auth()->id();
        $groupes_count = Groupe::where('user_id', $userId)->count();
        $adherants_count = Adherant::where('user_id', $userId)->count();
        $stock_count = Stock::where('user_id', $userId)->count();
        $events_count = Evenement::all()->count();
        // $events_count = Evenement::where('user_id', $userId)->count();
        $groupesData = $this->getGroupesData();
        $calculateStockTotal = $this->calculateStockTotal();
        // Calculate total montant
        $totalMontant = Cotisation::sum('montant');

select * from `stocks` where `user_id` = 1
---
    public function calculateStockTotal()
    {
        $userId = auth()->id();

        // Get all stocks for the current user
        $stocks = Stock::where('user_id', $userId)->get();