app/Http/Controllers/EvenementController.php

    public function calender()
    {
        $userId = auth()->id();
        $evenements = Evenement::all();
        $groupes = Groupe::all();
---
select * from `evenements`
select * from `groupes`