app/Http/Controllers/StockController.php

    public function index()
    {
        $userId = auth()->id();
        $stockTypes = StockType::where('user_id', $userId)->get();

        $stocksQuery = Stock::with('stockType')
            ->where('user_id', $userId)
            ->when(\Illuminate\Support\Facades\Request::input('search'), function ($query, $search) {
                $query->where('name', 'like', '%' . $search . '%')
                    ->orWhere('type', 'like', '%' . $search . '%');
            });

        $stocks = $stocksQuery->paginate(5)
            ->appends(\Illuminate\Support\Facades\Request::all());
---
select * from `stock_types` where `user_id` = 1
select * from `stock_types` where `stock_types`.`id` in (1)
select * from `stocks` where `user_id` = 1 limit 5 offset 0
select count(*) as aggregate from `stocks` where `user_id` = 1

    public function store(Request $request)
    {

        $stock = $request->validate([
            'name' => 'required',
            'type' => 'required',
            'purchase_date' => 'required',
            'quantity' => 'required',
            'price_per_unit' => 'required',
            'stock_type_id' => 'required|exists:stock_types,id'
        ]);

        // $stock = $request->all()
        dd($stock);

        $stock['user_id'] = auth()->id();

        Stock::create($stock);
---
insert into `stocks` (`name`, `purchase_date`, `quantity`, `price_per_unit`, `stock_type_id`, `user_id`, `updated_at`, `created_at`) values ('table', '2023-05-04', '12', '12', '1', 1, '2023-05-19 17:17:20', '2023-05-19 17:17:20')