app/Http/Controllers/StockTypeController.php

delete from `stock_types` where `id` = 1
---
    public function destroy(StockType $stockType)
    {
        $stockType->delete();